pmo-dataset/variations/graphviz_basic/12.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Adjust compensation" -> "ParallelGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_5";
  "ParallelGateway_4" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Set new responsibilities";
  "Set new responsibilities" -> "ParallelGateway_3";
  "ExclusiveGateway_4" -> "Work on skill enhancement";
  "start" -> "Identify development needs or career aspirations";
  "ExclusiveGateway_6" -> "ParallelGateway_1";
  "ExclusiveGateway_5" -> "Receive feedback and evaluation from supervisors";
  "Transition into new role" -> "ExclusiveGateway_3";
  "ParallelGateway_3" -> "Transition into new role";
  "Conducts formal performance review" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "Adjust compensation";
  "ExclusiveGateway_3" -> "end";
  "Work on skill enhancement" -> "ExclusiveGateway_6";
  "ExclusiveGateway_1" -> "Approve promotion";
  "Approve promotion" -> "ParallelGateway_2";
  "ParallelGateway_4" -> "ExclusiveGateway_5";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "Consider employee for promotion or new role" -> "Conducts formal performance review";
  "Receive feedback and evaluation from supervisors" -> "ExclusiveGateway_2";
  "Create personal development plan" -> "ParallelGateway_4";
  "ExclusiveGateway_2" -> "ParallelGateway_1";
  "Identify development needs or career aspirations" -> "Create personal development plan";
  "ParallelGateway_1" -> "Consider employee for promotion or new role";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
}
