pmo-dataset/variations/mermaid_with_ids/12.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Transition into new\nrole"]
	Task_2["Create personal\ndevelopment plan"]
	Task_3["Consider employee\nfor promotion or new\nrole"]
	Task_4["Conducts formal\nperformance review"]
	Task_5["Identify development\nneeds or career\naspirations"]
	Task_6["Work on skill\nenhancement"]
	Task_7["Adjust compensation"]
	Task_8["Receive feedback and\nevaluation from\nsupervisors"]
	Task_9["Approve promotion"]
	Task_10["Set new\nresponsibilities"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}

	Task_7 --> ParallelGateway_3
	ExclusiveGateway_2 --> ExclusiveGateway_5
	ParallelGateway_4 --> ExclusiveGateway_4
	ParallelGateway_2 --> Task_10
	Task_10 --> ParallelGateway_3
	ExclusiveGateway_4 --> Task_6
	StartNoneEvent_1 --> Task_5
	ExclusiveGateway_6 --> ParallelGateway_1
	ExclusiveGateway_5 --> Task_8
	Task_1 --> ExclusiveGateway_3
	ParallelGateway_3 --> Task_1
	Task_4 --> ExclusiveGateway_1
	ParallelGateway_2 --> Task_7
	ExclusiveGateway_3 --> EndNoneEvent_1
	Task_6 --> ExclusiveGateway_6
	ExclusiveGateway_1 --> Task_9
	Task_9 --> ParallelGateway_2
	ParallelGateway_4 --> ExclusiveGateway_5
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_1 --> ExclusiveGateway_3
	Task_3 --> Task_4
	Task_8 --> ExclusiveGateway_2
	Task_2 --> ParallelGateway_4
	ExclusiveGateway_2 --> ParallelGateway_1
	Task_5 --> Task_2
	ParallelGateway_1 --> Task_3
